EDT/УТ/src/Documents/НачислениеПоОкладу/НачислениеПоОкладу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеПоОкладу</name>
  <registerRecords>AccumulationRegister.СводПоЗарплате</registerRecords>
  <registerRecords>AccumulationRegister.мгЗарплатаНачисления</registerRecords>
  <attributes>
    <name>мгТерминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоРабочихДнейПоГрафику</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>мгОтветственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ФизЛица</name>
    <attributes>
      <name>ФизЛицо</name>
      <type>
        <types>CatalogRef.новаЭкспедиторы</types>
        <types>CatalogRef.новаВодители</types>
      </type>
    </attributes>
    <attributes>
      <name>Оклад</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтработаноДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>мгНачислениеЗаОсновнуюРаботу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/AccumulationRegisters/СводПоЗарплате/СводПоЗарплате.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СводПоЗарплате</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказательКоличества</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Корректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЮрЛицо</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипРасчетаЗарплаты</name>
    <type>
      <types>EnumRef.ТипыРасчетаЗарплаты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УчастникЭкипажа</name>
    <type>
      <types>EnumRef.УчастникЭкипажа</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.ПоказателиРасчетаУслугСД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
      <types>CatalogRef.новаВодители</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипНУ</name>
    <type>
      <types>EnumRef.ТипыНУЭкипажей</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT/УТ/src/AccumulationRegisters/мгЗарплатаНачисления/мгЗарплатаНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>мгЗарплатаНачисления</name>
  <resources>
    <name>Тариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидНачисления</name>
    <type>
      <types>CatalogRef.мгНачисленияУдержания</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
      <types>CatalogRef.новаВодители</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT/УТ/src/Enums/УчастникЭкипажа/УчастникЭкипажа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УчастникЭкипажа</name>
  <enumValues>
    <name>Водитель</name>
  </enumValues>
  <enumValues>
    <name>Экспедитор</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Enums/ТипыРасчетаЗарплаты/ТипыРасчетаЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыРасчетаЗарплаты</name>
  <enumValues>
    <name>СдельныйРасчетПоДоставкам</name>
  </enumValues>
  <enumValues>
    <name>РасчетПоОкладу</name>
  </enumValues>
  <enumValues>
    <name>НочныеСмены</name>
  </enumValues>
  <enumValues>
    <name>Магистраль</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Enums/ТипыНУЭкипажей/ТипыНУЭкипажей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНУЭкипажей</name>
  <enumValues>
    <name>Начисление</name>
  </enumValues>
  <enumValues>
    <name>Удержание</name>
  </enumValues>
  <enumValues>
    <name>РасчетЗП</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Documents/НачислениеПоОкладу/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр СводПоЗарплате 
	Движения.СводПоЗарплате.Записывать = Истина;
	Движения.СводПоЗарплате.Очистить();
	Для Каждого ТекСтрокаФизЛица Из ФизЛица Цикл
		Движение = Движения.СводПоЗарплате.Добавить();
		Движение.Период = Дата;
		Если ТипЗнч(ТекСтрокаФизЛица.ФизЛицо) = Тип("СправочникСсылка.новаВодители") Тогда
			Движение.УчастникЭкипажа = Перечисления.УчастникЭкипажа.Водитель;
		ИначеЕсли ТипЗнч(ТекСтрокаФизЛица.ФизЛицо) = Тип("СправочникСсылка.новаЭкспедиторы") Тогда
			Движение.УчастникЭкипажа = Перечисления.УчастникЭкипажа.Экспедитор;
		КонецеСли;	
		Движение.ТипРасчетаЗарплаты = Перечисления.ТипыРасчетаЗарплаты.РасчетПоОкладу;
		Движение.ФизЛицо = ТекСтрокаФизЛица.ФизЛицо;
		Движение.Сумма = Окр(ТекСтрокаФизЛица.ОтработаноДней/КоличествоРабочихДнейПоГрафику * ТекСтрокаФизЛица.Оклад);
        Движение.ПоказательКоличества = ТекСтрокаФизЛица.ОтработаноДней;
        //+++++Серегин М.В. 29.02.2016 12:15:46 
        Движение.ТипНУ = Перечисления.ТипыНУЭкипажей.РасчетЗП;
        //-----Серегин М.В. 29.02.2016 12:15:47 
	КонецЦикла;

	// Миго-групп ШушлебинДА {
	// 26.06.2017 
	Движения.мгЗарплатаНачисления.Записывать = Истина;
	Движения.мгЗарплатаНачисления.Очистить();
	Для каждого ТекСтрокаФизЛица Из ФизЛица Цикл
		Если ТекСтрокаФизЛица.мгНачислениеЗаОсновнуюРаботу <> 0 Тогда
			Движение = Движения.мгЗарплатаНачисления.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = ПериодРегистрации;
			Движение.Организация = ТекСтрокаФизЛица.Организация;
			Движение.Терминал = мгТерминал;
			Движение.ВидНачисления = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.НачислениеОсновное");
			Движение.Сотрудник = ТекСтрокаФизЛица.ФизЛицо;
			Движение.Тариф = ТекСтрокаФизЛица.мгНачислениеЗаОсновнуюРаботу;
		Иначе
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "В строке " + Строка(ТекСтрокаФизЛица.НомерСтроки) + ", у сотрудника " + Строка(ТекСтрокаФизЛица.ФизЛицо) + " не заполнена сумма!";
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЦикла;
	//} ШушлебинДА
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
